nice
rooms
experience
hotel
monaco
seattle
good
hotel
level
positives
large
bathroom
mediterranean
suite
comfortable
pillowsattentive
housekeeping
staffnegatives
unit
malfuncti
oned
stay
desk
disorganized
missed
separate
wakeup
calls
concierge
busy
hard
touch
vide
guidance
special
requests
hard
ipod
sound
dock
suite
functioning
decided
book
medi
terranean
suite
night
weekend
stay
choice
rest
party
filled
comparison
spent
night
larg
square
footage
room
great
soaking
whirlpool
jets
nice
shower
before
stay
hotel
arrange
ervice
price
reasonable
driver
waiting
arrival
checkin
easy
downside
room
picked
person
cuzi
bath
accessories
salts
bubble
bath
stay
night
12/1a
checked
voucher
bottle
champagne
nice
gesture
fish
waiting
room
impression
room
huge
open
space
felt
room
chore
change
channel
ipod
dock
broken
disappointing
morning
asked
desk
check
thermos
said
degrees
warm
cover
face
night
bright
blue
light
kept
room
night
drop
desk
called
maintainence
came
look
thermostat
told
play
settings
happy
digital
asked
wakeup
10am
morning
happen
called
later
wakeup
forgot
10am
wakeup
mornin
forgotten
bathroom
facilities
great
room
surprised
room
sold
whirlpool
bath
bath
amenities
great
relax
water
jets
going
nice
hotel
nice
staff
hotel
lovely
staff
quite
rude
bellhop
desk
clerk
going
make
things
difficult
waited
forever
check
heavy
bags
help
getting
throught
double
doors
room
worst
desk
lerk
checking
waited
pick
minutes
home
noticed
dollar
hold
credit
took
phonecalls
faxes
week
resolved
stay
warwck
lenora
rooms
friendly
faces
tiring
airport
hmmmmm
really
high
hopes
hotel
monaco
chose
base
girlfriend
shopping
trip
seattle
stay
competition
seattle
just
okay
hotel
nice
features
little
things
detract
bedding
super
soft
luxurious
comforters
pillows
mattress
rock
hard
standard
hotel
kept
awake
nights
furnishings
nice
colors
patterns
chair
wall
paper
peeling
stayed
room
noise
like
horn
vibrate
walls
stay
guess
water
pipes
really
annoying
waking
morning
packages
decaf
instead
regular
ffee
took
minutes
send
coffee
showed
just
package
coffee
town
little
package
tiny
dried
creamers
supposed
coffee
service
lobby
cleared
really
early
gone
10am
wine
reception
better
time
walk
5:50
like
look
manager
like
trying
scope
glass
food
plate
goldfish
crac
kers
classy
friday
night
restaurant
closed
private
party
planned
heard
bumme
rest
hotel
posters
things
like
hotel
comfort
felt
catered
comfortable
staff
aske
doing
said
hello
looking
visit
mind
noise
place
great
read
reviews
noise
used
hotel
website
book
room
interesting
site
give
checkbox
options
room
farthest
elevator
room
higher
floor
quiet
room
getting
quietest
room
possible
checked
hoping
floor
18-19
floors
hall
elevator
listened
trucks
ambulance
sirens
night
sheeeesh
aside
heating
units
sound
like
small
plane
engines
hear
surrounding
rooms
nois
sleeps
facilities
clean
conveniently
located
reasonably
priced
staff
quite
helpful
expectations
centrally
located
hotel
blocks
water
popular
nightlife
shopping
options
belltown
downtown
classify
property
star
location
paid
wedding
rate
sure
fares
value
proposition
room
spacious
little
outdated
rooms
decent
views
lower
floor
drab
panaroma
parking
buildings
adeq
uate
fitness
center
sauna
pool
basement
quaint
bar/restaurant
attached
hotel
parking
outrag
possibly
standard
downtown
street
parking
weekend
save
dollars
willing
stay
future
price
signifi
cantly
lower
nearby
four-star
competition
read
reviews
booked
knew
getting
mind
surprised
fact
better
expected
rooms
outdated
towels
floormat
limited
cable
overall
lack
amenities
hotel
reviewer
said
like
budget
overs
hotel
stayed
similar
condition
just
enjoyed
experience
check
desk
service
great
asked
extra
illows
maid
spent
flowers
pike
street
added
character
room
location
friends
stayed
fairmont
street
stayed
nights
night
cost
money
went
dinners
trip
victoria
baseball
games
location
unmatchable
price
range
simple
sleeping
room
expect
surprisingly
clea
hotels
seen
past
week
driving
staying
travelodge
days
motel
quality
furnishings
high
sure
little
spots
just
building
usual
character
flaws
none
affected
comfort
lucky
corner
room
especially
nice
look
know
paying
250+/night
bath
worked
care
watch
vacation
idea
worked
want
believe
comments
feel
free
mean
room
come
expensive
travellers
simple
fact
hotel
location
simply
unbeatable
mere
stone
throw
pike
market
plenty
great
restaurants
generally
area
tourist
quality
hotel
so-so
place
business
travellers
hard
especially
just
returned
trip
stayed
conrad
wynn
macau
compar
feels
like
motel
issues:1
desks
rooms
place
laptops
wireless
internet
place
work
furniture
coverings
worned
just
outdated
room
city
view
room
room
date
avoid
cost
window
sits
right
stop
claim
windows
double
paned
hear
buses
roaring
engines
sleep
plugs
desk
standalone
unit
attached
wall
central
standalone
unit
quite
noise
looks
tacky
business
center
machine
located
basement
hotel
price
paying
location
extremely
friendly
folks
check
fried
doughnuts
dhalia
lounge
okay
amazing
husband
stayed
weekend
night
spent
time
trying
great
place
stay
seattle
read
ipadvisor
reviews
listed
hotels
like
pretty
good
fantastic
place
great
fine
just
really
amazing
little
boutique
hotel
expected
reviews
ratings
thought
room
nice
incredible
service
better
woman
desk
friendly
things
wrong
note
visiting
seattle
canlis
incred
ible
meal
place
husband
stayed
hotel
seattle
nights
excited
book
room
style
hotel
alley
flor
motel
happy
impressions
room
decent
sized
bright
corner
windows
it__Ç_é_
pictured
websi
shepard
fairey
wall
asked
desk
clerk
parking
does
state
website
street
parking
available
street
parking
stay
start
charging
__Ç
info
drug
luggage
room
headed
thin
worse
size
listed
website
assumed
queen
beds
sized
sleeping
comfortably
little
ficult
sleep
happening
room
room
loading/delivery
zone
corner
stop
noise
staggering
ontinued
night
morning
wake
early
feed
meter
glowing
light
hall
showing
window
door
annoying
urned
requested
fairness
rest
staff
dealt
nice
accommodating
unable
following
night
hotel
shared
bathrooms
issue
finding
free
breakfast
include
coffee
fresh
waffles
toast
granola
juice
yogurt
apples
piles
good
magazines
available
guests
robes
rooms
second
night
slept
slig
htly
better
used
earplugs
acceptable
solution
wake
early
deal
night
moved
smaller
inte
rior
room
considerably
quieter
downed
music
hear
hall
bathrooms
room
walls
definitely
felt
dorm
room
sleep
better
recommend
hotel
traveling
friends
plan
doing
sleeping
loud
roomm
ates
come
home
drunk
play
loud
music
time
location
good
walking
attractions
like
space
needle
mark
good
restaurants
nearby
just
don__Ç_é_
know
stay
location
location
perfect
walking
distance
stairs
bags
problem
elevator
available
clea
noisy
woodden
floors
hear
rooms
street
breakfast
included
good
conclusion
good
compromise
great
price
okay
experience
stayed
queen
anne
nights
mid-january
2007
price
good
79/night
fine
shabby
clean
comfortable
having
kitchenette
microwave
stove
sink
fridge
great
room
prisingly
large
walk-in
closet
service
friendly
warned
desk
staff
leaves
11:00
calls
desk
fielded
staff
hotel
problem
example
needed
request
iron
ironing
board
morning
able
hote
queen
anne
answer
phone
queen
anne
elevator
problem
problem
some
downside
noise
hotel
soundproofing
rooms
night
2:30
next-door
neighbors
kind
party
going
hold
morning
plumbing
noise
deafening
morning
awakened
6:00
showers
rooms
however
location
great
otel
just
north
space
needle
smack
middle
seattle
bohemian-hip
neighborhood
excellent
shop
just
corner
restaurants
safeway
deep
sleeper
need
first-class
accomodations
hotel
good
bargain
great
location
staff
location
price
make
older
hotel
good
choice
staff
friendly
looking
modern
lace
studio
apartment
building
hotel
great
neighborhood
close
great
local
resturants
hotel
does
sterile
tourist
feeling
newer
range
hotels
feels
like
small
european
hotel
rooms
little
moderizing
compermise
just
reservations
stay
avings
seattle
expect
luxury
price
paid
knew
building
fine
decor
rooms
small
annoyance
tried
patience
times
like
getting
smoking
room
reservation
moved
days
later
avail
utlets
bathroom
mirror
main
area
non-smok
room
having
items
daily
maid
service
wash
bath
mats
maid
service
cleaned
unwashed
dishes
bonus
observed
items
irons
hair
dryers
extra
llows
available
desk
staff
spoke
help
continually
asked
check
later
accommodate
mbers
staff
spoke
knowledgable
hotel
lobby
brochures
pamphlets
mags
guided
looking
frills
walking
distances
including
great
restaurants
place
tips
bring
hair
dryer
iron
remember
vator
building
good
bargain
hotel
great
little
neighborhood
seattle
city
center
space
needle
arena
minutes
downtown
free
shuttle
materialized
promised
location
near
monorail
seattle
excellent
luxu
rious
definition
lovely
building
clean
quiet
rooms
kitchenettes
like
extended
stay
hotel
staff
courteous
helpful
parking
10/night
onstreet
parking
free
weekends
plentiful
events
going
arena
recommend
looking
safe
central
location
bargain
price
close
sigar
stayed
marqueen
week
expensive
different
experience
staying
typical
hotel-c
hains
charming
variable
service
front-desk
positive
helpfull
staff
room
spacius
quite
asked
quite
room
view
window
faced
brick
wall
probably
better
floor
cleaning
better
hotel
gene
soon
general
clean-up
close
location
space
needle
belltown
basic
room
special
employee
attitude
good
downtown
seattle
location
snobbish
attitude
desk
frie
ndly
luggage
handlers
outdated
interior
need
modernization
rooms
fairly
basic
awkward
small
netheless
clean
noisy
ambiance
proximity
mono-rail
blurts
super
sounding
horn
hours
night
nice
near
hotel
restaurants
pike
street
market
places
walking
distance
avoid
seedy
areas
night
locat
near
pike
market
pricey
independent
hotel
definately
think
staying
improve
customer
relatio
skill
pretty
good
spent
nights
moore
really
like
moore
really
cool
hotel
excellent
ation
walk
seattle
sights
good
spot
nightlife
funky
restaurants
checked
late
night
staff
accomod
ating
room
large
clean
comfortable
great
view
elliot
window
floor
right
near
elevato
hear
minimal
noise
shampoo
conditioner
brought
anyway
just
parked
street
free
came
paid
parking
meter
hours
then
picked
friend
airport
drove
vancouver
returned
seattle
final
night
stay
slightly
great
room
nice
freshly
painted
clean
faucet
shower
falling
difficult
night
staff
night
friendly
interrupted
minute
conversation
desk
agent
guest
information
using
guest
waited
clerk
unhappy
guest
relieved
great
guest
printer
boarding
pass
welcome
print
stay
save
questions
friendly
helpful
staff
great
location
reasonable
price
stayed
moore
nights
prior
alaska
cruise
trip
moore
locates
good
location
walk
pier
pike
place
market
downtown
area
easily
went
jogging
waterfront
nice
park
enjo
walk
pearl
pier
board
ship
nice
walk
downhill
location
excellent
price
hotel
ancy
clean
spend
little
bathroom
instead
sharing
worth
money
small
refrigerator
drink
problem
walk
stuff
want
nearby
this
hotel
good
budget
traveller
wants
stay
near
downtown
area
great
time
alaska
pearl
fanstastic
funky
boutique
hotel
different
plain
small
minimalist
decor
fancy
place
right
budget-minded
travellers
biggest
problems
are:1
parking-
hotel
parking
agreement
loca
garages
wind
parking
nearby
20/day
limited
access
especially
dark
neighborhood-
blocks
place
market
street
little
rundown
little
shady
dark
street
noise
awake
night
summer
mainten
ance-
water
work
bathroom
sink
elevator
small
noisy
elevatorall
things
said
deny
value
hotel
location
just
prepared
level
amenities
appropriate
money
perfect
love
hotels
searching
place
mini-family
reunion
pleased
moore
hotel
tell
owners
trying
1907
flavor
ceiling
lighting
fixtures
cast
iron
bathtubs
true
hotel
moore
reminded
tels
stayed
europe
private
sleeping
rooms
jack-n-jill
bathroom
floor
room
queen
twin
beds
beds
comfortable
furniture
basic
budget
hotel
variety
kept
closets
huge
enjoyed
looking
window
different
periods
architecture
area
bits
waterfront
seen
buildings
rooms
basic
clean
ditioning
windows
opened
allow
nice
breeze
room
staff
best
aimed
guided
great
eateries
expl
ained
parking
situation
able
stretch
vacation
dollars
helped
polish
birthday
cake
cold
stone
creame
room
management
hold
luggage
checkout
time
need
location
great
blocks
pike
market
blocks
rental
office
blocks
mono-rail
station
took
space
needle
seattle
center
encountered
homeless
peopl
area
encountered
parts
seattle
none
rude
forceful
area
hotel
buzzes
nightlife
variety
clubs
plus
birthday
group
needed
celebrated
cake
cream
drawback
encountered
noise
street
used
rtable
radio
white
noise
bothered
traffic
sounds
definitely
noisy
good
value
felt
like
weekend
away
wife
kids
wife
kids
honest-
know
wont
read
chose
seattle
easy
reach
hometown
vancouver
decided
moore
hotel
downtown
thrifty
poor
reading
previous
reviews
budget
staying
night-how
look
place
outside
knew
wasnt
going
buckingham
palace
pretty
spartan
desk
clerk
duty
pretty
friendly-one
check
inwas
turned
away
place
full-so
ahead
pleasantly
surprised
room-spacious
clean
frills
shampoo
soap
needs
mattr
felt
like
water
spring
touch
floor
hopped
so125
it-but
crikey
springs
surely
seen
better
days
tv-but
wait
remote-125
jumping
change
channels
trip
reception
nquire
whereabouts
saidremote-shrug
shoulders-our
guests
home
know
duration
stay
place
market-a
short
jaunt
hotel-fantastic
location-a
dubious
characters
major
city
parked
right
road
place
offering
spot
5-had
night
hoya/mayweather
fight
local
sports
pub-on
return
garage
full-now
problem-park
street
free-after
pmand
sunday
free
saturday
evening
winding
down-
seattleites
winding
up-the
noise
level
rises
crescendo-its
water
pipe
prominent
celing
floo
fixture
room
outdone
comes
life
gurgle
splutterand
keeps
hour
seattlitesdecide
time
fitful
sleep
something
hotel
though-somehow
quaintand
pleasant
obscene
kind
sorry
leave-or
thought
monday
office
looming
large
place
go-just
catch
sleepbefore
price
given
central
downtown
location
price
moore
good
value
two-star
price
fancy
adequate
clean
roomy
elevator
hallways
small
dingy
rooms
fine
beds
good
sufficient
channel
lection
telephone
bathroom
normal
size
adequate
motel-type
towels/face
cloths
soap
shampoo
conditioning
small
room
barely
sufficient
rural
area
street
noise
hotel
facing
expect
city
objectional
running
white
noise
helps
definitely
concur
reviewers
floor
higher
definitely
recommended
free
internet
service
lobby
staff
overly
helpful
iendly
provided
acceptable
service
best
thing
central
location
pike
market
good
restaurants
downto
sites
free
ride
area
good
location
inside
room
moore
place
good
section
downtown
seattle
center
pike
place
market
room
street
noisy
windows
open
switched
night
courtyard
room
reflected
traffic
noise
ourtyard
rooms
surround
moore
theater
want
stay
concert
night
unless
early
prefer
budg
hotels
near
seattle
center
great
location
great
price
stayed
moore
nights
right
memorial
standard
room
double
beds
priv
bath
floor
room
huge
sparsely
decorated
bathroom
average
small
large
walk-in
closet
conditioning
norm
seattle
room
clean
smell
cleaning
supplies
entered
room
desk
service
recommended
great
places
order
delivery
shuttle
airport
free
internet
terminal
lobby
apprec
iated
location
great
walkable
attractions
middle
downtown
free
zone
walk
want
room
approximately
night
stay
middle
road
sure
recommend
hotel
great
feel
comfy
beds
recommend
terrible
service
desk
staff
dirty
appearance
bathroom
husband
stayed
weekend
location
hotel
wonderful
perfect
cond
ition
hotel
perfect
headboards
tears
bathroom
sanitary
feeling
room
small
paint
coming
baseboa
places
feel
like
cosmetic
changes
make
room
appealing
spending
money
hotel
nonetheless
great
nice
conveniently
placed
feel
nothing
hisotric
seattle
expecting
breathtaking
reco
mmend
hotel
simly
need
stay-
suit
fine
nice
small
bathroom
stayed
hotel
nights
returned
night
leaving
seattle
king
size
room
actually
room
bathrooms
small
times
sink
tiny
second
time
room
toiletries
overall
room
clean
nice
flat-screen
road
noise
street
parking
night
privileges
good
location
small
fine
really
really
really
small
room
buildings
like
small
computers
guest
wi-fi
sitting
room/business
area
parking
costs
covered
garage
door
good
location
shopping
water
front
loved
elliotts
waterfront
restaurant
brooklyn
restaurant
loved
nordstroms
great
time
seatt
good
news/
news
seattle
just
night
opted
location
price
lack
conditioning
room
quite
uncom
fortably
warm
large
screened
window
ceiling
bureau
going
speed
location
prime
walked
right
wonderful
tour
seattle
library
walked
street
pike
market
street
frye
museum
staff
pleasant
pretty
small
adult
couple
teenage
daughter
coffee
shop
lobby
good
quick
continental
breakfast
better
just
week
seattle
loved
minute
pacific
plaza
good
improvement
floor
heat
builidng
rise
room
room
non-smoking
internal
ventilation
draw
smoke
rooms
staff
courteous
helpful
location
good
stayed
saturday
night
stop
flying
home
floor
overlooking
expressway
hear
noise
restaurants
walked
square
blocks
hotel
nothing
open
2000
saturday
hotel
restaurants
decided
good
choice
comfortable
today
checking
bank
statements
unexplained
charge
credit
card
real
test
phone
calls
correct
mistake
really
just
hotel
nothing
special
isolated
close
expressway
expect
rate
online
sites
werent
planning
stay
group
rate
room
worthwhile
certainly
ldnt
seen
rate
room
clean
spacious
comfortable
really
great
view
city
service
frie
ndly
desk
pretty
slow
hotel
fully
booked
busy
pool
pleasant
restaurant
expect
renaissance
hotel
hill
fairly
steep
climb
cheap
taxi
ride
didnt
feel
like
walking
overpriced
friends
family
discount
room
overpriced
location
great
walking
various
places
city
room
tiny
idea
hilton
insists
making
people
internet
access
especially
room
expensive
particularly
impressive
good
location
average
rooms
great
exec
lounge
stayed
daughters
downtown
hilton
property
night
holi
weekend
nice
view
buildings
desk
staff
polite
helpful
treat
older
guests
litt
disrespect
parking
joke
nite
positive
executive
lounge
little
cramped
offered
free
drink
appetizers
everynight
exec
concierge
helpful
dinner
salty
included
complimentary
limo
ride
hilton
kids
stay
points
business
money
look
booking
average
facilities
need
overhaul
feel
dated
service
reason
stay
good
rate
need
central
locati
just
fine
make
minute
trip
seattle
conventions
going
closest
hotel
downtown
area
arrive
dingy
exterior
does
ease
mind
does
location
room
things
improve
newly
renovated
clean
uite
comfortable
room
quiet
despite
facing
busy
street
rooms
quite
small
live
used
tight
quart
really
bother
breakfast
room
makes
high
school
cafeteria
feel
like
ritz
depressing
skip
talk
walk
belltown
proper
coffee
kind
breakfast
want
totally
acceptable
motel
edge
town
seattle
stay
quality
suites
seattle
located
blocks
seattle
center
home
space
needle
area
orig
inally
built
1962
world
fair
area
appears
offices
stations
walk
blocks
restaurants
food
court
center
house
near
space
needle
monorail
seattle
center
runs
westlake
center
mall
plenty
shop
ping
restaurants
hotel
built
fair
added
years
recently
rooms
updated
room
small
adults
htseeing
time
fine
room
double
beds
included
microwave
refrigerator
bathroom
updated
marble
fixtures
staff
friendly
helpful
hotel
clean
hotel
stay
room
quiet
hotel
busy
highway
closed
noise
problem
parking
free
hotel
great
downtown
hotel
stalls
limited
serve
nice
eakfast
near
pool
area
breakfast
room
fills
quickly
earlier
better
area
hotel
tourist
friendl
thought
hotel
bargain
115/night
adults
free
breakfast
free
parking
downtown
seattle
left
hand
does
know
right
doing
desk
clerks
helpful
getting
type
room
booked
month
advan
maids
baggage
handlers
courteous
helpful
ricky
desk
clerk
know
doing
pool
closed
nights
promises
open
soon
double
room
book
nicer
queen
room
book
nice
stay
sheraton
stayed
sheraton
nights
july
seattle
area
business
assigned
club
floor
room
tower
pike
tower
older
rooms
corridors
quite
clean
fresh
happened
34th
floor
just
fitn
center
pool
35th
floor
renovation
quite
drilling/jack
hammering
going
9:00am
4:00pm
annoyi
going
temporary
fitness
facility
setup
newer
tower
does
room
comfortable
nice
large
flat
panel
television
plenty
space
spread
hotel
staff
friendly
check-in
process
quick
effici
location
great
plenty
shopping
restaurants
quick
walk
doors
stayed
westin
seattle
year
raton
location
nicer
pleasant
stay
impressive
husband
attending
conference
hotel
chose
stay
directly
hotel
conference
days
spen
alexis
absolutely
gorgeous
booked
directly
sheraton
website
unable
accommodate
room
newly
refurb
ished
section
hotel
unless
chose
room
double
beds
room
good
sized
drab
bathroom
cramped
compared
alexis
offered
toiletries
provided
perfumey
simple
pleasure
enjoy
lotions
hotel
provides
positive
note
comfortable
heater
noise
minimal
desk
staff
nice
they
nickel
dime
12/day
inclu
ding
internet
break
spoiled
room
amenities
alexis
place
stay
time
stay
bellevue
instead
write
review
leisure
traveller
hotel
superb
location
beds
super
comfortable
valet
parking
said
rooms
modern
starting
year
television
strikes
lay-out
bathroom
open
door
walk
straight
wall
better
sober
step
shower
foot
toilet
quiet
noise
showers
allow
fallback
sleep
awaken
noise
doors
closing
compared
door
close
arguementwith
girlfriend
boyfriend
foundations
literallly
shake
know
want
stay
hotel
price
charged
going
spend
money
stay
hyatt
westin
budget
stay
bellevue
hotels
everybit
nice
better
commend
bellevue
athletic
club
hyatt
westin
taxi
public
transport
town
save
money
steak
dinner
chris
careful
book
careful
room
type
person
husband
room
double
beds
kings
available
beds
took
room
lounge
chairs
struck
corner
really
going
spending
nights
moved
hotel
bigger
rooms
steps
highly
recommend
location
central
great
shopping
linens
comfortable
staff
nice
hange
room
decent
room
affordable
price
downtown
seattle
went
visit
friend
seattle
mid-september
game
husky
tadium
chose
place
looking
various
websites
affordable
hotel
room
downtown
place
bill
average
typical
midgrade
hotel
clean
real
downside
walls
hold
sound
outside
heard
noise
rooms
outside
fortunately
slept
well
staff
nice
willing
hold
bags
hours
checked
ther
restaurant
hotel
breakfast
food
pretty
good
this
hotel
blocks
westlake
center
terminus
union
streetcar
monorail
seattle
center
space
needle
area
blocks
pike
place
market
hill
price
great
bargain
downtown
seattle
clean
little
noisy
location
great
staff
frie
ndlly
able
leave
parking
hours
checked
real
nice
bonus
just
need
place
sleep
night
bargai
price
want
amenities
stay
walk
pike
place
market
breakfast
seattle
native
pleased
sixth
avenue
onpriceline
mote
just
motel
right
middle
downtown
seattle
think
remember
seattle
world
fairin
1962
dated
hroom
shelf
space
overlook
type
thing
amazing
safe
location
think
returned
drive
access
important
location
unbeatable
long
waits
elevators
walks
endless
lobbies
poof
pike
place
market
belltown
downtown
monorail
football
baseball
venues
ride
exploring
downtown
seattle
goal
want
play
dollarsinstead
paying
high
rise
view
motel
great
location
stayed
property
times
like
hotel
location
hotel
walking
distance
pike
market
hopping
seattle
hotel
parking
small
nightly
rate
payed
rooms
clean
good
beds
exper
ienced
problems
stays
place
price
recently
stayed
2004
nights
trip
seattle
familiar
area
hotel
price
night
room
fair
improvements
nice
hotel
upon
arriving
noticed
hallways
funny
smell
rooms
clean
athroom
small
hard
people
ready
mirror
dresser
difficult
ready
room
husband
showered
needed
extra
towels
person
provided
extras
dresser
pillows
lumpy
iron
board
room
arrived
front
staff
accomodating
helpful
restaurant
twice
good
food
service
slow
ordered
long
island
iced
strong
tried
bartender
handed
sweet
sour
wash
drink
charged
commented
kind
drink
handle
liquor
patron
paying
meals
drinks
overall
recommend
short
stay
days
nicer
places
located
heart
downtown
want
quite
title
review
basically
sums
recent
stay
andra
overall
satisfied
stay
deep
discount
left
wondering
listed
small
luxury
hotels
world
king
corner
suite
suite
quite
spacious
quiet
restful
sleep
beds/linens
soft
comfortable
brought
extra
pillows
requested
plenty
storage
closets
drawers
plus
generously-sized
night
tables
plus
however
sofa
disappointing
cheap
construction
sagging
middle
fairly
uncomfortable
watch
armchair
seriously
needed
recovering
edges
worn
dirty
frayed
suite
overhaul
soon
noticed
chipped
paint
plus
chipped
scratched
furnitur
carpets
felt
grimy
overall
feeling
room
cleaner
bathroom
small
knew
going
having
read
reviews
bother
adequate
shelves
storage
like
soaking
forget
overflow
drai
obviously
designed
hates
baths
maximum
water
level
came
lower
abdomen
reclined
tryi
soak
water
kept
draining
gave
minutes
shower
pressure
good
tons
water
time
face
stoc
kholm
amenities
delicious
subtle
white
fragrance
bottles
size
postage
stamps
cheap
luxury
hotel
staff
happy
send
tiring
request
daily
basis
staff
20-30
somethings
pleasant
eager
feel
chieved
luxury
level
service
simple
request
sent
seattle
times
york
times
like
read
local
daily
basis
received
york
times
credit
swiftly
replaced
seattle
times
request
asking
days
time
asked
desk
person
reconfirm
reservation
concierge
left
looked
like
handed
dead
fish
nitpicking
expect
maybe
motel
luxury
hotel
actually
place
andra
slightly
star
hotel
uxury
level
staff
accomodating
pleasant
room
stay
rate
stay
high
season
rate
pprox
felt
service
room
worth
good
service
great
beds
over-priced
stayed
hotel
andra
nights
staff
helpful
stay
place
beautiful
decorated
rooms
average
size
place
quite
clean
wonderful
usually
terrible
night
sleep
great
sleep
nights
hotel
noisy
husband
hotel
priced
billed
small
luxury
hotel
really
different
decor
location
great
walked
hotel
breakfast
lola
adjoining
restaurant
excellent
doughnuts
raving
overall
enjoyed
stay
time
stay
expensive
priceline
deal
stayed
nights
visiting
family
booked
priceline
reading
online
reviews
somewhat
leased
stay
book
priceline
twin
beds
barely
long
heating
dificult
operate
fireplace
nice
arking
28/day
pretty
steap
hard
offsite
parking
moring
told
upgrade
king
water
room
extra
ight
better
room
great
view
larger
just
away
cruise
terminal
door
alaskian
cruiseship
stayed
seattle
sheraton
following
night
priceline
liked
hotel
better
nice
scene
noisy
rooms
loved
ocean
scene
seagulls
giant
sets
rooms
walls
bothered
asked
person
noisy
neighbours
experience
change
kitchen
great
lounge
cool
worth
average
hotel
high
price
stayed
night
city
view
want
park
nice
comfortable
rooms
just
ttle
high
priced
nice
view
lobby
loan
want
restraunt
nice
rooms
shame
gloomy
hotel
thing
notice
hotel
gloomy
lobby
dark
wood
lighting
forget
tryi
read
breakfast
restaurant
unless
close
window
need
light
little
natural
light
communal
areas
ggest
criticism
hotel
rooms
regular
room
suite
just
fine
extremely
comfortable
lovely
line
nice
touches
real
coffee
real
coffee
press
view
parking
concrete
tried
change
rooms
said
poor
views
hotel
like
places
staff
great
room
cleaned
desk
unapologetical
told
sunday
expected
night
expect
better
people
talk
character
place
certainly
better
chains
august
just
felt
gloomy
great
hotel
heart
downtown
walking
distance
need
stayed
overnight
going
play
paramount
walk
hotel
comfy
room
service
pretty
fast
little
convenience
store
block
away
avoid
mini
prices
agree
reviewers
room
match
price
used
price
feature
payed
price
listed
westin
bsite
ended
small
room
right
elevators
hear
people
talking
hall
pile
drivers
door
begin
luckily
room
priceline
unluckily
locked
nights
changed
hotels
ight
17th
floors
north
tower
facing
sound
space
needle
right
directly
building
going
drivers
sound
groaning
crane
began
plugs
drown
sound
make
sure
room
know
facing
building
10th
floor
write
looks
like
going
booking
time
september
weekends
another
issue
lack
little
fridge
minibar
really
stuck
want
save
dime
having
snacks
want
taurant
coldwater
grill
raining
hard
opted
pricey
wonderful
dish
ravioli
stuffed
peas
ricott
really
fresh
broccolini
commented
place
fancy
fluffy
beds
good
views
huge
impersonal
corpora
feel
fair
hotel
good
location
arrived
late
tired
flight
receptionist
efficient
unfriendly
help
luggage
foyer
huge
frayed
edges
need
urgent
refurbishment
31st
floor
view
lovely
room
think
upgrading
bathroom
floor
good
scrubbing
breakfast
restuarant
good
value
bettervalue
aller
cafe
premises
concierges
good
great
cent
oysters
shore
cafe
happy
hour
well
placed
urist
sites
space
needle
expensive
good
tourist
talk
given
pike
market
quite
good
people
friendly
loved
seattle
price
right
stayed
travelodge
mid-late
march
2006
booked
online
paid
upfront
cost
nights
cluding
disappointed
arrival
discover
hotel
exactly
downtown
seattle
writeup
booking
claimed
heart
downtown
seattle
having
cafes/restaurants
close
important
especially
lone
female
writeup
claimed
guests
able
walk
myriad
restaurants
bars
entertainment
options
whilst
technically
true
implication
lots
places
close
true
truly
wonderful
mexican
cafe-restaura
blocks
away
called
amigos
recommend
place
highly
pizza
delivery
place
romio
hotel
information
folder
room
totally
great
food
hotel
placed
like
writeup
implies
frankly
main
ntown
starts
blocks
away
goes
blocks
streets
warned
want
significant
downtown
oing
walking
monorail
action
having
said
overall
enjoyed
stay
travelodge
walls
ceilings
littl
whilst
bothered
guests
conversation
creaky
floorboards
right
annoying
especially
habit
coming
morning
initially
allocated
room
ground
floor
getting
room
exaggeration
room
window
looked
right
parking
left
window
open
anybody
climbed
lone
female
happy
rang
desk
asked
higher-up
room
problem
clerk
wheeled
luggage
cart
moving
stuff
easier
having
noticed
stru
ggling
pieces
luggage
getting
original
room
skis
boots
suitcases
sweet
fact
really
stay
trave
lodge
little
thoughtful
things
greg
afternoon-evening
shift
friday
saturday
nights
glad
asked
room
ground
floor
general
area
hotel
gets
quite
noisy
anxious
undesirables
outside
room
felt
perfe
ctly
safe
noise
simply
minor
annoyance
free
breakfast
tasty
juices
coffee
apples
donuts
things
donut
dough
muffins
preferred
addition
cereals
lovely
search
food
thing
morning
room
king
linens
just
little
small
firm
comfy
good
size
wardrobe
plenty
hangers
mini
fridge
noise
woken
night
heater/air
conditioner
difficult
right
temperature
reason
warm
nigh
turned
night
make
things
better
plenty
channels
installed
sort
entertainment
centre
dresser
large
drawers
provided
plenty
clothes
storage
space
nice
large
table
laptop
chair
impossible
glass
table
handy
putting
pizza
boxes
bedside
tables
just
tables
drawers
annoying
blackout
curtains
windows
total
darkness
pulled
nice
bathroom
adequ
size
people
shower
good
condition
door
adjustable
shower
heads
sort
massage
water
pressure
ight
hairy
edge
good
annoyance
water
temperature
took
forever
enjoyable
shower
turning
minutes
wanted
shower
like
waste
resources
sub-par
really
necessary
wait
long
water
just
warm
shower
shivering
away
right
shower
water
finally
pleasant
wanted
left
having
just
come
disastrous
stay
zealand
friends
canada
sleeping
floor
living
room
zero
privacy
dump
apartment
hung
sign
soon
arrived
brought
housekeeping
notices
door
days
saying
wanted
room
serviced
remove
sign
figured
wanted
left
comment
standard
housekeeping
complaints
arrival
couple
sits
pool
perfectly
adequate
pool
need
hydroth
erapy
left
shoulder
appreciated
extra
towels
desk
pool
poolside
supposed
drop
pool
wels
meant
going
room
shivering
swimsuit
appreciated
free
local
calls
mins
duration
unli
mited
free
1-800
calls
enabled
speak
husband
zealand
internet
free
time
talked
weeks
allowed
significant
online
research
seattle
environs
allowed
make
time
there
another
thing
real
appreciated
free
toiletries
arrived
toothpaste
lovely
grocery
drug
store
evening
arrival
note
bathroom
saying
range
toiletries
available
free
nice
touch
offered
toothbrush
asked
toothp
aste
hotel
definitely
budget
hotel
want
luxury
experience
mind
walls/ceilings
want
real
downtown
seattle
staff
friendly
beds
comfy
showers
nice
price
right
location
hotel
short
walk
away
space
needle
minute
drive
downtown
seattle
location
prompt
stay
hotel
plus
daily
stay
hotel
older
clean
breakfast
pretty
good
alot
choose
employees
relatively
nice
nice
group
late-teens
partying
hallway
hours
shady
characters
rooms
definately
beat
location
single
traveler
cheap-
easy
convenient
single
individual
traveling
alone
internet
service
close
proximity
university
washington
village
shopping
center
clean
bathroom
room
decent
hotel
great
location
booked
rooms
priceline
star
hotel
downtown
seattle
husband
friends
ights
paid
120/night
corner
room
friends
room
elevator
bigger
room
bathroom
possible
corner
room
rooms
ending
corner
rooms
comfy
room
clean
lovely
l'occitane
toiletries
funny
animal
print
velour
bathrobes
closet
heavy
drapes
block
light
facilitates
good
nights
sleep
view
rooms
long
thing
frustrating
fact
temperature
does
degrees
degrees
like
room
cold
really
loss
hotel
does
wine
hour
missed
night
served
duck
pond
wines
seco
night
served
pizza
restaurant
tulio
hotel
restaurant
zagat
rated
pretty
funny
hear
concierge
ouring
wine
tell
wine
washinton
just
driven
past
winery
oregon
given
couple
bottles
wine
friend
oregon
wine
valet
checked
snooty
irritated
chose
park
hotel
street
save
little
money
valet
arking
30/day
plus
self-park
park
street
cost
26/day
wait
desk
staff
stuffy
snooty
probably
expected
tier
hotel
stayed
nicer
hotels
friendlier
desk
staff
concierge
availa
needed
recommendations/directions/maps
desk
girls
second
night
kind
look
late
night
movie
times
hotel
blocks
pike
place
market
trip
foot
space
needle
hike
worth
pastries
walk
stor
coffee
shops
kinds
restaurants
blocks
standard
experience
good
value
encourage
stay
pricie
fairmont
corner
unless
cost
concern
pretty
good
experience
worth
high
price
stayed
saturday
night
double
deluxe
base
price
room
taxes
closer
expecting
really
nice
when
checked
desk
person
really
disinterested
barely
spoke
taken
back
handed
room
keys
word
said
room
elevators
amenities
blah
blah
blah
checked
different
person
said
barely
word
weird
kind
service
expect
pricey
hotel
room
somewhat
shabby
tacky
looking
stains
sofa
room
brown
velvet
piece
seen
better
days
beds
fine
room
advert
ises
dvd/cd
player
tried
play
work
called
desk
rings
picked
told
maybe
cords
come
undone
wanted
muck
cords
figure
bolted
armoire
really
reach
hand
ordered
room
service
phone
rang
times
answered
food
pretty
plain
example
panini
bread
bread
room
comes
goodie
basket
minibar
guessed
mini
took
forever
answer
phone
disappointed
free
goodies
room
doubletree
cookie
hotel
come
cookie
hotel
closet
animal
print
terry
cloth
robes
wash
times
extremely
faded
pairs
socks
welcome
additional
pair
gripe
room
bathroom
small
overall
place
okay
looking
money
spent
altogether
spent
time
spend
classier
place
chic
snotty
stayed
weekend
having
hotel
close
airport
training
attending
seattle
decided
come
early
sights
left
husband
home
solo
trip
quite
time
chose
location
price
reputation
hotels
general
stayed
before
start
positives
room
excellent
great
decor
comfy
nice
flat
creen
great
quality
toiletries
question
scent
combo
lemon
sage
cleaning-product-y
darkness
loud
ness
common
areas
took
getting
used
certainly
makes
cool
chic
vibe
hotel
different
average
marriot
sheraton
typically
stay
enjoyed
free
wi-fi
lobby
evening
great
apple
martini
location
excell
quick
flat
walks
main
attractions
negatives
married
woman
traveling
took
little
ease
espe
cially
dining
solo
went
concierge
desk
evening
having
just
arrived
seattle
hour
hoping
little
encouragement
great
recommendations
granted
partially
fault
wanting
babied
desire
came
prev
ious
experiences
concierges
cities
usually
excited
tell
introduce
city
acted
totally
aloo
felt
like
cool
tried
different
concierge
helpful
definitely
level
used
inquiring
erry
bainbridge
island
told
bother
provide
schedule
asked
specifically
schedule
said
natural
thing
hand
telling
leaves
concierge
service
really
complaint
seattle
poor
rating
going
present
luxury
hotel
need
luxury
service
earn
average
rating
entirely
trendy
wife
recently
stayed
seattle
enjoyed
stay
things
prevented
rating
hotel
higher
verage
coffee
maker
room
know
seattle
starbucks
corner
hotel
stayed
secondly
place
nickel
death
example
night
parking
small
cheese
sandwich
restaurant
like
walked
saturday
night
lobby
turned
popular
nightclub
seattle
literally
spinning
dance
music
reco
loud
lobby
beautiful
people
impressed
snobby
wealthy
self
centered
person
hotel
dark
orations
common
areas
artsy
fartsy
reason
wife
stayed
fair
great
rate
website
hotel
located
fantastic
location
returning
good
quality
rooms
facilities
fine
actually
quite
spacious
problem
size
hotel
floors
rooms
floor
justs
make
feel
like
passes
touching
mixed
metaphor
know
like
40-60
room
utique
hotels
know
mean
staff
friendly
helpful
just
twice
good
sized
location
plus
issue
water
leave
complimentary
label
telling
watering
added2
room
internet
plus
free
business
centre
homeland
microsoft3
food
trays
left
outside
rooms
long
time
nothing
major
wrong
just
taste
interesting
hotel
best
described
woman
rode
elevator
7-day
stay
person
need
light
re-don
hotel
tucked
historic
fairmont
olympic
hotel
seattle
trouble
seeing
bring
flashlight
elevators
dark
carpet
tiny
pendant
lights
elevators
fast
ready
jump
jump
lobby
two-level
lighted
tea-lights
great
sleeping
room
choose
upgrade
worth
wide
screen
flat-panel
great
shiny
bathro
good
office
space
comfy
couch
prompt
room
service
good
honor
really
expensive
sele
ction
okay
plenty
wonderful
places
walking
distance
like
schuckers
door
coffee
lovers
dream
arbucks
seattle
best
tully
close
short
walk
downhill
shopping
long
walk
uphill
purchases
downe
pool
mixed
experience
travel
frequently
work
pleasure
hotel
mixed
experience
reservation
order
rrived
despite
calling
twice
making
sure
incidentals
cleared
room
hold
credit
card
arrival
told
possible
reasonably
credit
card
placed
hold
hours
later
resting
room
cleaning
staff
came
empt
incidentals
room
charge
card
room
crowded
small
compared
similar
boutiques
ncisco
knob
window
heater
opposed
digital
moderates
temperature
native
minnesota
seattle
fairly
mperate
comparison
huge
deal
factor
coming
warmer
climate
does
want
wake
roasting/freezing
eventually
room
felt
cozy
instead
cramped
getting
used
decor
entertaining
there
multiple
occas
ions
days
room
smoky
likely
nearby
smoking
room
opening
window
solved
problem
hear
neighbors
talk
normally
room
positive
doorways
stunning
hotel
certainly
personality
desk
friendly
know
ledgeable
competent
free
business
center
high
speed
internet
printers
location
prime
walking
part
city
typically
minute
wait
walk
uphill
block
westin
line
available
cabs
take
looking
cras
night
great
choice
looking
spend
time
probably
better
choices
available
money
modern
artsy
booked
hotel
weekend
getaway
chose
hotel
travelzoo
deal
queen
room
00/ni
pretty
good
deal
compared
00/night
hotels
area
parking
steep
00/night
opted
park
office
building
street
mind
leaving
outdoors
overnight
open-air
parking
economical
room
small
overnight
luggage
large
suitcase
want
stay
feels
like
staying
guest
room
friend
place
staying
hotel
room
room
nice
view
courhouse
nice
aveda
toiletries
terrible
coff
decent
extremely
comfortable
sheets
scratchy
advantage
neat
pillow
menu
iritual
menu
location
hotel
decent
walking
distance
downtown
attractions
pike
place
market
greyhound
station
would
stay
hotel
night
choose
stay
elsewhere
family
stay
families
kids
nice
cool
desk
people
manager
nice
spotty
service
time
fawne
time
ignored
trendy
spot
like
start
walking
space
topless
painting
painting
does
offend
year
kids
stunned
overpriced
agree
reviews
helpful
staff
ready
help
offer
recommendations
valet
parking
effi
cient
again
rooms
extremely
small
just
dresser
closet
bathroom
decided
artist
king
room
views
claimed
roomier
imagine
queen
rooms
like
given
small
size
king
room
given
worst
room
hotel
mistakenly
quoted
extra-low
room
rate
sheets
super-starched
selection
pillows
nice
bathroom
towels
cheap
scratchy
sink
starting
wear
conditioner
adjustable
tempera
ture
settings
quite
strong
nice
night
second
used
towels
removed
replaced
loca
tion
good
interested
market
downtown
shopping
definitely
closest
option
able
closer
paying
hotel
does
does
offer
does
equate
high
prices
paid
price
rooms
prime
location
boutique
tels
rooms
small
small
things
right
like
soft
fluffy
towels
pleasant
stay
seatac
recently
pleasant
stay
doubletree
hotel
seatac
visiting
seattle
area
weeke
time
doubletree
hotel
shocked
given
chocolate
chip
cookies
check-in
cookies
soft
warm
touch
long
morning
traveling
country
finding
room
difficult
hotel
parts
tower
motel
sectio
branches
motel
section
confusing
finding
room
hang
things
like
walk
long
distances
annoyed
large
size
hotel
hotel
plenty
ammenities
lack
available
business
center
free
internet
access
pool
area
available
rooms
line
available
rooms
setback
computers
ailable
near
coffee
shop
lobby
taken
peak
hours
breakfast
buffet
restaurant
lobby
food
overall
bland
boring
typical
hotel
food
better
jack
street
walk
international
blvd
sharp
roasters
regret
hotel
downtown
seattle
walking
distance
tacoma
area
proximity
arious
flight
crews
various
airlines
bunk
quite
flights
shuttle
airport
runs
minutes
rented
pass
prepared
shell
14-16/day
parking
staying
motel
section
able
park
near
section
able
alking
times
drastically
overall
reccomend
hotel
specifically
short
stay
gets
nicely
nice
decent
airport
hotel
below-average
business
travelers
looking
hotel
close
airport
above-average
uttle
service
great
customer
service-
excellent
choice
rooms
worn
edges-
bathrooms
furniture
updating
feel
beds
best
seen
doubletrees-
better
hotel
chains
balconies
scary
tacky
rooms
spacious
vanity
outside
bathroom
great
families
clean
looking
night
hotel
flight
cruise
choice
looking
place
multiple
night
stay
prefer
modern
decor
expecting
great
views-
best
election
business
traveler
used
hilton
honors
hotels-
check
hilton
seattle
airport
block
doubletre
stayed
better
selection
similar
cost
best
attribute
proximity
airport
rooms
particularly
posh
large
kind
dingy
definitely
need
odeling
wife
stayed
night
flying
sea-tac
morning
hotel
fine
purposes
wanted
longer
stay
room
priceline
parking
added
extra
exorbitant
guess
standard
airport
hotels
allegedly
queen
like
double
business
centre
internet
access
free
open
desk
hours
pool
whirlpoo
nice
prefer
access
like
health
club
room
service
typically
expensive
food
average
best
beware
beware
leave
vehicle
took
advantage
park
ride
unfortunately
vehicle
broken
sunshine
just
returned
week
trip
dominican
overall
enjoyed
stay
travel
agent
advised
colony
resort
recently
opened
sure
service
confirm
food
services
staff
entertainment
staff
quite
eager
help
language
barriers
times
nothing
staff
learning
english
french
italian
food
generally
good
theme
nights
evening
steakhouse
pizzeria
require
bookings
evening
meals
easily
morning
early
afternoon
travel
advise
pizzeria
does
require
bookings
snack
disc
o/sports
hesitant
tacos
hesitant
food
left
awhile
wrapped
noticed
juice
cooked
weine
dripping
cheese
sauce
yuck
night
steakhouse
evening
started
roof
buffet
confusion
staff
acted
quite
quickly
visitors
slow
leaving
building
roof
roofs
resort
palm
leaves
sure
started
anaged
thankfully
windy
location
alarms
water
sprinklers
noticed
rooms
drywall
buildings
concr
blocks
hotel
manager
issue
letter
apology
room
during
stay
roof
repaired
imagine
buffet
nning
meantime
meals
handled
beach
buffet
steakhouse
steakhouse
instead
ordered
sirloin
fine
partners
grissily
order
chicken
wing
appetizers
overall
food
good
issue
flie
food
especially
likely
open
buffet
cream
availalble
breezeway
pizzeria
sports
yummy
cream
buffets
bugs
bite
assuming
mosquito
staff
spray
mosquitoes
witnessed
heard
twic
daily
room
clean
care
keyed
doors
friends
problems
room
power
turned
card
thing
dominican
people
power
disruptions
occur
problems
internet
available
main
lobby
posted
area
wear
watch
