horrible
customer
service
hotel
stay
february
2007my
friend
picked
hotel
monaco
appealing
website
online
package
included
champagne
late
checkout
free
valet
gift
weekend
friend
check
room
hours
earlier
came
later
pulled
valet
young
just
stood
asked
valet
open
said
pull
didn__Ç_é_
offer
help
garment
suitcase
came
room
number
says
valet
street
pull
left
working
asked
valet
park
gets
went
room
fine
bottle
champagne
lotion
gift
dressed
went
came
noticed
blood
drops
pillows
sheets
pillows
disgusted
just
unbelievable
called
desk
sent
somebody
minutes
later
swapped
sheets
left
apologizing
morning
called
desk
speak
management
sheets
aggravated
rude
apparently
manager
kind
supervi
weekend
wait
monday
morning
young
spoke
said
cover
food
adding
person
changed
sheets
said
fresh
blood
rude
tone
checkout
package
booked
1:30
staff
maids
tried
walk
room
opening
apologizing
closing
people
called
saying
check
remind
package
finally
packed
things
went
nstairs
check
quickly
signed
paper
took
took
closer
look
room
unfortunately
covered
food
ered
charged
valet
called
desk
charges
lady
answered
snapped
saying
aware
problem
experienced
monday
like
told
earlier
life
treated
like
hotel
sure
hotel
constantly
problems
lucky
ones
recommend
anybody
know
noise
airconditioner-a
standard
arranged
stay
travel
agency
unfortunately
warwick
seattle
hotel
issapointment
trip
night
stay
warwick
changed
rooms
starting
minute
stay
hotel
personnel
didn
make
feel
like
guest
like
intruder
reluctant
help
solve
complaints
hotel
right
downtown
minu
really
good
restaurants
like
good
thing
availability
room
offered
floor
window
directly
ening
parking
level
changed
room
rooms
loud
sound
coming
conditioner/
heating
unbelieva
hotel
hotel
personnel
told
standard
noise
rooms
tried
avoid
using
night
order
sleep
possible
watching
loudly
choice
booked
hotel
wire
called
immediately
requesting
nonsmoking
room
king
room
away
elevator/ice
person
spoke
pleasant
stated
guarantee
requests
honored
make
note
reservation
check-in
person
desk
rude
said
special
request
noted
reservation
card
andstated
king
beds
reservation
stuck
double
beds
located
directly
accross
elevator
nonsmoking
elevator
parking
garage
hotel
warwick
mats
garage
filthy
stairwells
hotel
faces
smells
urine
carpets
registration
elevator
area
need
cleaning
upholstery
curtains
room
needed
cleaning
andpressing
sign
bathroom
water
conservation
facet
dripped
continuously
drain
needsattention
shower
curtai
holes
coffee
maker
room
bedding
sleeping
directly
mattress
bedding
askew
unfriendly
short
housekeeping
staff
quite
pleasant
stay
hotel
hated
terrible
room-service
horrible
staff
un-welcoming
decor
recently
updated
lacks
complet
look
managment
staff
horrible
grunge
lives
does
mold
mildew
tiny
metal
sink
cool
extra
instead
nightsta
stay
clear
internet
reservation
friday
rang
hour
later
thursday
booking
thursday
rang
arriving
late
said
problem
arrive
30pm
hear
booking
tonight
room
total
apath
concerned
says
sorrys
looks
reservation
book
sorrys
apathy
finally
says
door
calls
autho
rity
hangs
says
sorry
times
incompetence
management
employees
completely
soured
trip
stay
away
single
rooms
like
hospital
rooms
single
rooms
hotel
sparse
intentional
know
ugly
like
trapped
hosp
ital
white
walls
sink
basin
room
small
rectangle
shape
beds
hard
rocks
blankets
rough
really
this
overrated
hotel
stayed
stype
hotels
worst
hotel
experience
booked
nonsmoking
room
online
weeks
advance
stay
crowne
plaza
downtown
seat
arrival
desk
staff
asked
consider
smoking
room
completely
unacceptable
family
clearly
stated
consider
smoking
room
mainly
concern
infant
daughter
health
particular
staff
member
went
quietly
desk
staff
member
agreed
particular
room
entered
room
smell
cigarette
smoke
apparent
imagine
desk
staff
intentionally
smoking
room
informing
days
later
discovered
ashtray
matches
hecked
desk
discover
fact
smoking
room
intentionally
kept
reserved
nonsmoking
room
clothes
ongings
baby
reeked
cigarette
smoke
addition
appalling
lack
concern
health
wishes
room
servi
night
stay
asked
desk
manager
room
serviced
checked
housekeeping
informed
disturb
door
disturb
case
inside
door
entire
time
anxiously
awaiting
staff
garbage
dirty
iapers
replace
towels
desk
manager
offered
pathetic
compensation
complimentary
hotel
breakfast
exposed
carcinogenic
cigarette
fumes
days
having
rooms
cleaned
definitely
stay
crowne
plaz
hotel
quaint
rundown
decided
celebrate
graduation
high
school
trip
seattle
chose
queen
anne
proximity
experience
music
project
space
needle
funky
shops
eateries
nearby
hotel
described
quain
pictures
hotel
website
nice
gave
shot
upon
entering
hotel
greeted
carpet
lobby
filthy
torn
uh-oh
thought
good
sign
desk
overbooked
paid
confirmed
reservations
late
arrival
weeks
prior
room
left
beds
took
hurriedly
left
things
room
grab
quick
bite
returning
getting
noticed
room
windows
open
double
clean
twin
hairy
sheets
closet
talking
fashioned
pull-out
bed-this
actually
tiny
twin
stuffed
closet
went
kitchenette
leftovers
fridge
fridge
mold
work
went
desk
complain
told
nothing
sucked
tried
sleep
took
sheets
used
sons
lanket
eventually
closet
stuffy
jumped
sons
morning
experienced
plumbing
issues
toilet
shower
bugs
bathroom
packing
looked
make
sure
discovered
possessions
stayed
housekee
pers
clean
beds
change
sheets
canceled
rest
stay
decided
leave
seattle
drove
anacortes
sante
inn-
palace
compared
night
before
wrote
manager
queen
anne
requesting
refund
recei
letter
saying
refund
given
gave
coupon
stay
word
quaint
queen
anne
uses
advertising
rundown
advice
anybody
staying
check
room
white
glove
inspection
make
sure
working
order
agre
stay
queen
anne
policy
reserve
room
charge
card
immediately
refund
hours
advance
cancellation
ridiculous
terrible
hotel
approximately
weeks
april
2007
reservation
hotel
night
2007
wrote
foll
ow-up
request
reply
advised
reservation
cancelled
overbooking
wote
giving
reservation
number
just
wrote
just
saying
sorry
making
effort
room
nearby
hotel
emails
brigeta
operation
manager
written
approximately
weeks
stay
positive
left
scrambe
hotel
lobby
queen
anne
pract
unforgivable
especially
light
having
resevation
number
guarenteeing
room
2007
point
making
advance
reservations
hotel
suddenly
cancel
little
advance
notice
sincerely
greg
scanlonsan
francisc
dumpy
place
problems
head
starts
spinning
thinking
start
like
10pm
check-in
told
park
parking
left
room
tiny
carpet
dirty
spots
room
came
kitchen
nasty
used
especially
fridge
time
opened
nasty
odor
rotten
vegetables
gushed
fridge
filled
entire
room
night
hear
eople
talking
walking
stairwell
right
outside
noise
streets
right
outside
window
substantial
just
sound
insulation
place
bathroom
surprisingly
clean
room
appeared
well-kept
shower
pressure
rrible
stay
water
twice
fact
morning
took
cold
shower
basically
start
desk
staff
gene
rally
nice
completely
uncaring
unhelpful
sure
problem
thing
liked
place
ceiling
walk-
closet
paid
100/night
place
suppose
reasonable
seattle
center
area
night
stay
holiday
express
basically
recommend
place
dump
stayed
weekend
expected
charming
1929
property
based
web-site
reviews
expedia
expect
charming
mean
incompetent
staff
showers
randomly
scalding
cold
medium
pressure
just
trickle
tacky
acoustic
ceilings
moldy
non-functional
windows
shower
screens
windows
having
room
left
locked
maid
service
having
wait
hours
iron
gave
minutes
make
wedding
having
parking
hought
desk
reality
expedia
apparantly
publish
negative
reviews
like
gather
tried
times
publish
on-line
calling
customer
service
exchanging
e-mails
beware
reviews
exped
especially
beware
hotels
like
decent
location
nice
staff
disappointing
read
reviews
citysearch
trip
advisor
moore
hotel
called
book
shared
bathroom
queen
room
avail
lived/traveled
europe
year
think
shared
bath
problem
fiance
shared
bathroom
toilet
shower
entire
floor
stayed
room
rooms
bathroom
read
correctly
rooms
people
room
bathroom
everytime
day/night/6am/midnight/noontime
tried
show
busy
paper-thin
walls
shower
toilet
room
tiny
room
dirty
sink
room
smaller-than-reserved
-bed
miserable
asked
change
rooms
told
tried
hotel
seattle
150/night
impossible
loved
town
stay
hotel
passed
homeless/drunk/druggie-looking
types
hotel
night
sure
felt
safe
fiance
wanted
warn
experience
stay
capitol
hill
belltown
close
downtown
action/shops/mass
transit
away
enjoy
locals
seattle
rudest
people
dont
stay
despite
fact
cool
hotel
place
sucks
desk
nights
rudest
people
problem
room
extremely
rude
hear
issue
dissapointed
terrible
experience
awful
night
stay
planned
staying
dirty
policemen
gested
safer
place
town
price
spend
little
lots
advantages
miss
stayed
hotel
friend
weekend
19th-21st
september
stayed
recommended
friend
book
basis
stay
easonable
definitely
case
time
disappointing
things
weekend
executuve
hotel
pacific
placed
directly
opposite
elevators
floor
noise
elevators
guests
returning
home
early
hours
morning
loud
usually
heavy
sleeper
hear
clearly
night
cleaning
staff
racket
morning
difficult
sleep
past
specific
online
request
small
fridge
room
medications
obviously
ignored
online
pleas
chec
previously
similar
hotels
offered
small
portable
fridge/cooler
exact
purpose
conditioni
work
turn
produced
worrying
burning
smell
turned
used
weeks
tried
open
window
stuck
cool
fresh
stuffy
room
bathroom
small
size
main
issue
shower
head
virtuall
pressure
toilet
noisy
time
flushed
hear
toilets
adjacent
rooms
quite
clearly
poor
plumbin
suggested
desk
staff
reasons
said
fully
booked
night
change
rooms
second
night
agreed
presen
desk
room
staff
member
stated
nothing
documented
book
room
change
booked
help
fact
freely
admitted
just
used
room
guest
checked
minutes
overbooked
rooms
guests
check-in
magine
reputable
hotel
does
admits
guests
glad
check-out
returning
hotel
time
gladly
extr
dollars
decent
hotel
room
service
stay
away
dirty
rooms
stayed
better
places
seattle
room
size
prison
cell
window
facing
outsid
wall
quiet
showered
flushed
toilet
plus
seattle
best
coffee
lobby
right
downtown
hotel
limo
pect
yellow
hotel
staff
helpful
friendly
cramped
noisy
overrated
husband
just
stayed
hotel
mid-july
horrible
experience
superior
queen
room
incredibly
cramped
noises
elevator
guests
rooms
nearly
impossible
sleep
night
hotel
promises
amenities
wireless
internet
access
rooms
working
felt
like
paid
place
sour
tone
beginning
vacation
nights
cancelled
rest
stay
booked
hotel
upgrade
outdated
arrived
given
junior
suite
marriott
silver
status
upgraded
room
joke
switches
roken
linens
sagged
sitting
radiator
addition
nearly
impossible
king
size
walking
room
room
away
highway
road
noise
wife
didnot
sleep
wink
night
morning
cancele
days
reservation
moved
towneplace
suites
near
airport
half
price
better
renaissance
worst
riott
stayed
stay
away
dirty
place
watch
limited
english
used
reading
reviews
sounds
like
complete
different
hotel
stayed
9/12-9/15
room
club
level
floor
rooms
needed
updating
understatement
usual
care
decade
style
problem
decades
dirt
cause
room
itch
produce
rash
case
everytime
left
room
reath
itch
return
room
began
carpet
multi
dark
color
hide
years
goodness
knows
dare
walk
barefoot
carpet
tore
doorway
tiles
loose
bathroom
usually
hotel
remodels
starts
expensive
room
remodels
long
beds
beds
nothing
special
bathroom
size
closet
forget
closing
door
possible
need
know
friends
requested
handicap
room
wheelchair
handicap
room
regu
room
couple
shower
bars
minumum
legal
requirement
service
personal
check
course
spoke
complete
coherent
english
need
know
want
communicate
housekeeping
staff
gift
store
incredibly
strating
tell
housekeeping
leave
extra
towels
draw
pictures
called
parking
garage
unmanned
entr
completely
unsafe
need
know
dark
shadowed
underground
exceptionally
tight
spaces
elevators
clear
actually
enter
doorways
stairs
flight
reach
elevator
places
stairways
believe
town
carefu
check
breeze
check
english
speaking
folks
hidden
course
want
money
aggrevating
however
note
credit
card
charged
twice
entire
stay
having
worst
time
resolving
issue
reason
feel
compelled
connecting
desk
hotel
folks
billing
trying
days
worst
hotel
experience
thinking
booking
room
hotel
just
traveled
seattle
work
colleagues
minar
booked
room
priceline
asking
3-star
hotel
downtown
seattle
reservations
renaissance
supp
osedly
4-star
hotel
disaster
half
rooms
freeway
building
noise
large
container
trucks
rumbling
night
switch
rooms
earplugs
help
block
noise
rooms
pretty
shabby
scratched
dama
furniture
complained
management
asked
switch
rooms
told
priceline
rooms
discounted
rooms
xpect
quality
paying
guests
ended
having
extra
night
just
adequate
rooms
half
group
rooms
hotel
construction
going
early
morning
quite
late
night
rooms
terribly
noisy
earplugs
noise
staff
acted
like
complaints
guests
able
sleep
noise
news
want
hear
acted
indignant
dare
complain
extremely
rude
dismissive
also
machines
broken
floors
search
floors
working
attempt
minibar
mini
refrigerator
rooms
spot
refigerator
used
removed
enaissance
bills
4-star
hotel
rating
based
solely
hotel
lobby
stars
based
shabby
rooms
noise
service
rude
staff
stretched
star
stay
renaissance
hotel
horrible
customer
service
worst
hilton
possibly
worst
hotel
trying
review
guidelines
feel
importa
people
know
kinds
business
practices
into
stayed
hilton
nights
second
night
having
weddin
reception
hilton
booking
went
smoothly
room
decent
exectutive
sweet
overpriced
discou
having
reception
there
problems
arrived
later
reception
short
summary
things
happened
-eleva
tors
having
issues
night
-myself
reception
stuck
lobby
reception
elevators
working
card
given
working
up-the
closing
party
early
party
staff
locking
room
allowing
entrance
gather
belongs
reception
room
additional
hour
half
booked
contract-a
hilton
staff
member
challe
nging
fist
fight
telling
aggravated
insisted
-having
head
security
apologize
actions
said
staff
member
-finally
getting
executive
suite
stay
rest
night
-having
police
wife
assaulted
ilton
staff
member
tried
fight
putting
hand
getting
security
apologized
-after
police
left
heari
story
hour
later
long
elevators
broken
night
manager
security
officer
showed
kick
mentioned
assa
glad
arrest
made
-after
threatening
lawyers
involved
breach
contract
told
stay
-getting
minutes
later
night
manager
apologize
told
work
sort
discount
trouble
-waking
morning
finding
doubl
charged
room
parking
vehicles
ours
-dealing
people
nice
saying
work
getting
charges
reversed
right
back
-finding
hilton
additional
charges
outlined
contract
consent-being
told
willing
reve
small
portion
charges
staff
says
story
false
breached
contract
refused
credit
sure
action
burned
abuse
received
agree
worst
hilton
absolute
worst
hilton
stayed
gold
members
travel
absolute
worst
hilton
world
week
vacation
year
daughter
took
hilton
properties
south
lake
tahoe
whist
rate
hiltons
excellentfirst
charge
night
internet
room
free
wireless
internet
ilable
executive
lounge
small
converted
guest
room
lobby
went
executive
lounge
comical
business
eople
packed
elbow
elbow
laptops
using
free
internet
eating
drinking
free
food
sight
sure
de-cong
executive
lounge
charge
internet
stayed
hilton
honors
floor
noticed
dirty
dishes
newspa
pers
hall
picked
days
there
excercise
room
size
walk
closet
treadmills
stepper
jammed
there
people
provided
sort
customer
service
bellmen
desk
personnel
management
delt
customer
serv
skills
parked
hilton
garage
window
smashed
ransacked
hilton
security
simply
left
siness
card
smashed
window
took
time
sweep
glass
ground
discovered
hilton
security
knew
broken
smashed
window
days
notify
series
failures
hilton
staff
touch
seattle
hilton
ector
security
asked
notified
broken
response
policy
parking
manual
hilton
honor
stated
contact
monday
wednesday
response
finally
drafted
lenghty
letter
hilton
corporate
regarding
seattle
hilton
stay
plenty
nice
hotels
seattle
terrible
stay
bellman
lost
luggage
phones
work
dirty
sheets
letter
manager
answered
acknowledged
better
staying
avoid
costs
place
nightmare
understaffed
messy
arrived
guests
deep
desk
telephone
continua
ringing
employee
later
lone
employee
hired
week
room
clean
medicinal
smell
cleaning
fluid
overwhelming
hallways
elevator
dirty
littered
place
absolutely
appeal
close
worth
night
worse
stay
hotel
help
concierge
idea
sites
city
espically
finding
concierge
knew
fisherma
terminal
advised
taking
knowing
cabs
return
area
stuck
hour
calling
hotel
assistance
having
tell
nothing
guests
upset
book
just
returned
seattle
booked
seattle
sheraton
towers
nights
left
hotel
night
desk
inquire
leaving
club
floor
hours
morning
continental
breakfast
hours
evening
canapes
closed
tight
evening
poured
coffee
used
small
plastic
container
cream
dish
coffee
cream
curdled
coffee
staff
personnel
talk
room
dreary
stains
carpets
good
location
hotel
defini
tely
seen
better
days
book
false
information
family
just
finished
7-day
alaskan
cruise
looking
hotel
seattle
ttle
service
pier
hotel
hotel
airport
place
leave
luggage
went
site
seeing
downtown
bookin
company
particular
hotel
assured
criteria
hotel
booked
room
just
store
luggage
ended
travel
accomodations
hotel
airport
ended
having
taxis
destinations
needless
angry
extra
hotel
hotel
manager
available
phone
customer
service
reps
finally
called
times
sent
mail
website
matter
resolved
hopefully
said
reimburse
taxi
fares
believe
advice
situation
grab
airport
flat
downtown
seatac
airport
check
luggage
early
ride-on
downtown
eniors
free
kids
free
ride
downtown
seattle
everyday
budget
booked
hotel
weekend
november
recommendation
clean
spartan
room
travel
book
expecting
eriously
whelmed
room
tired
felt
dirty
slept
fully
clothed
wore
socks
times
shower
gross
toilet
clean
pillows
felt
filled
cotton
balls
creaked
squeaked
slightest
movement
carpet
stained
feel
lock
door
work
faced
lovely
strip
club
noise
outside
hotel
expect
downtown
location
noise
inside
hotel
obscene
people
banging
door
morning
party
room
menti
felt
right
walls
general
paper
hear
neighbours
conversations
watching
some
staff
friendl
sharpest
location
great
walk
reccomend
embarresed
stayed
checked
tripadvisor
place
terrible
just
reviewers
tripadvisor
indicates
couple
reviews
looks
like
written
hotel
staff
exact
opposite
real
experience
from
quality
toiletries
inconsistent
house
keeping
property
rated
star
attempts
property
unique
look
succeeds
making
incredibly
poor
decorated
like
joke
hotel
noisy
rooms
tiny
decor
ugly
staff
average
isolated
rest
seattle
view
overrated
nearby
train
noisy
room
stinky
lounge
expensive
drinks
good
view
absolut
character
experiencing
boring
lounge
decided
bother
restaurant
instead
cabbed
city
food
recommend
using
tripadvisor
pick
star
hotel
instead
foolish
like
consequences
fact
probab
pick
highly
rated
star
hotel
fare
times
better
overpriced
great
disappointing
property
setting
stilts
hanging
water
fabulous
ends
decor
incongruous
impressions
seattle
cabin-ish
better
suited
lodge
vermont
colorado
reques
water-facing
room
check-in
told
cost
dollars
paid
having
forked
dollars
night
declined
took
city
facing
room
irritating
colleague
booked
room
rate
agent
checked
right
behund
water
acing
room
extra
charge
asking
notwithstanding
decor
hotel
looks
tired
worn
room
abysmally
small
amazed
american
travellers
accept
rooms
size
knowing
spacious
hotels
general
large
perso
problem
typically
smaller
rooms
finds
eurpoean
continent
barely
space
double
sharing
claustrophobic
city-facing
rooms
railway
line
busy
level
crossing
clanging
bell
time
train
passe
happens
night
rooms
need
twice
size
sound-proofed
nights
trot
chaicago
seattle
franc
isco
worst
value
cities
better
price
seattle
terrible
accomodations
ruined
impression
seattle
decided
stay
hotel
hearing
work
colleague
great
lace
stay
waterfront
seattle
booking
stay
checked
website
talk
misleading
pictures
hotel
afternoon
checked
immediately
disappointed
hotel
hallway
room
dirty
reminded
college
ormitory
hotel
room
overlook
water
train
tracks
small
clean
drawers
clothing
desk
additionally
hotel
loaded
folks
spent
weekend
hemp
fest
recommend
fooled
website
heard
town
dinner
highly
recommends
black
market
alexis
wish
earlier
think
different
seatt
experience
time
waste
money
edgewater
absolutly
worst
booked
room
wife
trip
seattle
edgewater
ended
having
plane
delays
mechanical
neau
called
edgewater
inform
late
arrival
ended
arriving
late
finally
reached
edge
water
room
reserved
main
issues
heating
cold
night
general
condition
room
asked
desk
relo
cate
room
informed
rooms
available
stay
early
morning
asked
moved
asked
room
accepting
inform
room
available
4:00
desk
wanted
leave
bags
comfortable
accepting
room
sight
unseen
charges
accrueing
wife
agreed
time
cancel
staythe
edgewater
refused
adjust
credit
card
contac
wwte
online
reimbursement
received
adjustment
charges
wwte
night
business
trip
seattle
noisy
room
room
beautiful
killer
view
right
ballrooms
wedding
reception
going
wife
took
40th
birt
hday
supposed
romantice
evening
away
kids
noisy
11:00
evening
listening
muffled
music
peopl
dancing
manager
budge
giving
compensate
experience
offer
smaller
room
stay
stay
riday
saturday
night
stay
away
ballroom
possible
watch
spent
single
night
westin
seattle
left
favorite
jacket
closet
left
room
worried
reporte
missing
jacket
just
hours
check
town
days
inquiries
attention
trying
track
jacket
appea
logical
conclusion
hotel
employee
nice
jacket
expected
budget
accommodation
supposedly
hotel
close
track
things
choose
stay
checked
immediately
checked
tour
pacific
north
west
pre-booked
junior
suite
rate
night
rival
21st
floor
musty
smell
neglect
tobacco
spite
smoke-free
claims
suite
turned
adjacent
adjoining
rooms
dark
unclean
uncared
just
plain
shabby
base
stained
bathroom
tiny
arate
shower
general
facilities
incl
ancient
befitting
cheap
motel
immediately
compained
sked
modern
suite
told
none
available
added
confession
hotel
overdue
renovation
credit
manager
clerk
dealt
courteous
professional
manner
called
pacific
turned
superior
spacous
clean
autiful
recent
opening
cheaper
result
experience
immediately
cancelled
booking
westin
vancouve
later
tour
changed
pacific
superb
sadly
think
westin
sliding
downhill
resting
laurels
glory
good
today
market
customer
care
booked
travelocity
flight
cancelled
snow
delayed
westin
refused
refund
nights
200+
night
hotel
greedy
mention
view
great
work
barely
slept
expect
minimum
work
room
still
waiting
hear
travelocity
refund
told
left
town
refused
happily
cost
rental
extra
dealing
time
soon
facilities
good
location
structural
issues**
stayed
property
fairly
regularly
months
generally
eaking
nice
hotel
great
concierge
service
location
solid
however
staying
seattle
windy
night
winds
gusts
expect
sleep
mentioned
previous
posts
window
seals
interior
walls
components
structure
creek
loudly
rooms
wind
conditions
stayed
towers
12th
north
18th
south
type
wind
conditions
general
problem
building
observed
individuals
complain
directly
desk
morning
overall
good
hotel
stay
risk
getting
windy
night
different
opinion
important
hotel
airport
quality
westin
downtown
price
stayed
westin
week
9/15/07
observations
rooms
extremely
stained
carpets
bathrooms
outdated
fixtures
amenties
nearly
worth
night
price
rized
heavenly
bedis
nothing
special
time
including
lower
hotels
like
courtyard
hyatt
place
tter
beds
heavenly
bath
joke
no-name
substandard
bath
products
tub/shower
combinations
abound
lighting
half
work
poorly
placed
standard
ceilings
hotel
scents
abundant
rvice
hotel
staff
nice
failed
deliver
efficient
quality
service
room
service
times
recieving
screw
check
staff
good
eager
please
food
attended
meeting
facility
food
nasty
eggs
runny
breakf
food
typical
rubber
chicken
type
food
people
speak
talk
conference
food
nothing
worthy
praise
arena
including
dull
meeting
room
reminiscent
hospital
waiting
rooms
safety
high
value
item
stolen
group
hotel
staff
pretty
pathetic
approach
resolving
situation
best
hour
half
provide
rgency
number
seattle
police
department
overall
disatisfied
hotel
blocks
area
safe
upscale
stay
rand
hyatt
sheraton
avoid
dated
underserviced
property
unless
night
stayed
westin
hotels
worst
includes
staying
dreaded
westin
priceline
room
pitiful
really
recommend
considering
relocating
seattle
spent
nearly
week
touring
area
budget
even
price
night
place
expected
room
hallways
dirty
smell
urine
permeated
parking
homeless
people
sleep
hedges
neighboring
business
there
economical
hotels
area
instead
boyfriend
stayed
easter
weekend
chose
hotel
location
parking
paid
room
central
walkable
arket
neighbourhoods
good
restaurants
space
needle
aside
location
parking
pleasant
stay
hallw
smelled
smoke
room
clean
need
renovation
reception
sign
stating
rent
rooms
purpose
underag
drinking
somethign
effect
blackout
curtains
completely
ripped
mentioned
asked
replaced
pillows
overed
plastic
woken
repeatedly
late
night
partiers
barking
went
continental
breakfast
muffin
fruit
coffee
joined
pretty
dodgy
people
look
like
staying
beer
bottle
elevator
trav
budget
happy
quieter
safer
feeling
hotel
best
western
street
looked
like
better
looking
laxing
place
stay
city
unclean
terrible
service
stayed
save
money
campus
visit
university
washington
arrived
told
early
check
asked
check
bags
went
walk
agreed
just
desk
taking
giving
check
okay
person
office
just
desk
area
staff
hide
away
room
words
seconds
reach
steal
bags
asked
store
luggage
contained
camcorder
laptop
backroom
like
normal
hotel
refused
came
time
check
room
horrified
badly
stained
bedskirt
towels
chairs
feel
comfortable
sitting
lampshade
stained
coffee
sure
care
night
choose
freeze
butt
turn
ridiculously
loud
heater
pipes
shower
visible
rust
bathroom
just
clean
worst
motel/hotels
stayed
know
lower
standards
dget
just
intolerable
bother
dump
door
room
warped
room
hallway
stunk
time
bedding
stained
pillows
springs
dirty
room
offered
better
supposed
non-smoking
room
tell
reservations
nights
tolerat
money
terrible
service
arrived
hotel
overbooked
canceled
reservation
desk
lady
impatient
rude
informe
cancellation
showed
person
lady
offer
help
hotel
probably
better
place
looked
like
dump
construction
worse
walls
floors
torn
reception
area
left
lady
care
situation
unwilling
help
hotel
weekend
dozen
hotels
availability
caused
unecessary
stress
able
mariner
game
early
stay
read
reviews
book
hotel
start
arrived
desk
check
booked
line
wanted
credit
card
husban
tried
tell
wrong
room
told
quiet
haha
given
room
number
torn
piece
paper
went
rooms
smoking
packages
tables
smelled
bathroom
dirty
tile
moldey
painted
look
flat
king
sheets
stay
conditioner
worked
minutes
time
room
horrib
experience
husband
friends
kande
coulee
probably
wont
stay
email
sent
vagabond
stayed
vagabond
seattle
aurora
septembe
9-11
2005
realize
paying
deluxe
accommodations
wonder
able
place
vacancy
near
downtown
wante
located
money
able
spend
said
probably
wont
stay
time
spend
extra
money
nicer
cleaner
hotel
leave
guest
card
room
comments
wrote
enjoy
stay
grading
scale
d-fhave
stayed
hotel
oreason
trip
business
personal/pleasurewould
stay
property
hotel
appearance
exterior
dhotel
appearance
interior
chotel
staff
friendliness
minus
girl
dark
curly
hair
nice
helpfu
hotel
staff
efficiency
same
although
clerk
shift
sept
friendly
checking
later
asked
internet
service
annoyed
check
needed
business
purposes
want
lobby
guests
checking
trying
work
guest
room
cleanliness
cguest
room
appearance
bathroom
cleanliness
dbathroom
appeara
cwhy
counter
bathroom
slope
downward
frustrating
trying
ready
belongings
rolling
count
counters
level
comments
reservations
confirmed
hotel
wireless
access
room
called
clerk
told
room
signal
unable
laptop
room
specifically
brought
check
finances
finances
sure
money
trip
unable
check
company
home
check
e-mail
comfort
room
your
beds
uncomfortable
beds
lept
lack
thereof
life
felt
like
cement
blocks
granted
people
like
firm
beds
firm
problems
sligh
spine
curvature
painful
beds
hurt
plus
tired
weekend
lack
sleep
beds
difficult
schedule
seattle
additional
days
hour
drive
home
year
kept
asking
swimming
ally
decided
time
called
desk
time
pool/hot
closed
clerk
said
pool
drained
available
disappointed
especially
towels
bathroom
dirty
smelled
like
black
smudges
stains
lack
hairs
stuck
suggest
buying
nice
towels
guests
felt
like
sandpaper
maybe
housekeeping
fabric
softener
evening
needed
wash
couple
pieces
clothing
site
states
onsite
laundry
facil
ites
mispelt
page
available
laundry
facilities
outside
door
took
clerk
minutes
unlock
fault
helpful
maybe
locksmith
install
works
washer
washer
available
closet
type
space
extremely
irty
unplug
outside
vending
machines
time
using
washer
dryer
trip
breaker
clear
indication
hotel
meet
electrical
code
site
specifically
clearly
states
free
parking
night
additio
hotel
room
ended
including
in-room
wireless
internet
pool
sincerely
appreciate
parki
fees
deducted
stay
date
stay
9/9/05-9/11/05i
appreciate
response
email
thank
ahead
reserve
said
actually
stay
hardly
straight
called
confirm
phone
reservatio
despite
hesitation
reviews
booked
talked
marilyn
assured
updated
room
newer
beadspreads
facing
space
needle
w/an
actual
room
called
days
prior
date
reservation
thank
told
heavy
accent
guarantee
rooms
somebody
staying
like
reasons
make
reservations
said
just
cell
right
felt
taking
risk
staying
place
customer
service
person
writing
charges
card
information
good
respect
frequent
business
traveler
seattle
interested
trying
vintage
park
great
reviews
eceived
normally
reviews
reflect
experience
case
night
arrived
late
ordered
room
service
poun
ding
door
opened
parked
pushed
salad
said
house
ordered
rest
stay
didn__Ç_é
better
came
room
evening
un-breathable
hazy
unbelievable
cigarette
smoke
called
desk
told
azement
smoking
floor
reservation
non-smoking
sure
annoying
woman
desk
going
stay
room
rooms
decorated
manner
reminiscent
1960
italian
bordello
complete
large
mirrors
reception
area
tasting
occurs
thing
smaller
hotel
room
simply
wasn__Ç_é_
worth
pushing
crowd
forget
sweet
otato
gnocchi
looked
tasted
suspiciously
like
tater
tots
disappointed
stayed
seattle
week
june
professional
conference
previously
stayed
orlea
loved
second
expecting
great
things
seattle
disappointed
think
darkness
equates
ambiance
wrong
loud
music
elevators
elevators
supposed
like
mini-clubs
meet
party
people
orlea
elevators
worst
thing
smell
conditioning
went
best
described
little
pure
hotel
management
respond
numerous
complaints
saying
normal
lavender
musk
smell
right
just
sure
came
room
luckily
seattle
great
city
lots
email
apology
corporate
logging
complaint
starwood
stay
recieved
marketing
spam
seattle
stay
seattle
recommend
disappointment
desk
hotel
august
12-15
2004
arrived
11:30am
told
check
till
open
suitcase
lobby
things
need
city
walking
pictures
suitcase
placed
storage
meantime
came
night
check
desk
girl
asked
credit
card
asked
picture
told
suitcase
storage
told
need
told
going
open
suitcase
lobby
second
time
humiliating
hotel
manager
said
thing
need
offer
alternative
suggested
room
suitcase
open
privately
ofer
apologies
finally
desk
girl
suggest
check
staff
room
suitcase
able
picture
agreed
this
this
shows
hotel
supposed
cool
desk
hotel
manager
told
staff
hotel
manager
coming
group
70-80
people
incident
pass
unnotice
management
coordinating
people
think
times
decide
book
hotel
future
meeting
etrocalgary
contemporary
funky
hotel
just
cheap
dump
fooled
meagre
display
called
contemp
orary
decorating
building
tiny
tiny
rooms
bathrooms
rooms
stunk
damp
mildew
really
beds
rooms
think
bates
motel
bathroom
decorated
small
bowl
sink
left
original
tubs
fixtures
inexpensive
work
flat
screen
mounted
wall
bedding
good
open
luggage
barely
walk
elevator
lift
fitting
just
people
long
waits
halls
rooms
scarey
dark
narrow
pressive
area
hotel
clearly
hotel
cheap
cosmetic
decoration
slip
star
categary
dump
putting
products
bathroom
does
make
smell
size
decor
room
size
comparable
hostel
star
hotel
strongly
recommend
paying
staying
lots
options
night
hotel
ruin
vacation
rude
blah
reason
stayed
jacuzzi
suite
wish
stayed
hotel
charm
lobby
rooms
throom
tiles
falling
missing
screws
smoke
seeped
floor
came
bathroom
receptionists
rude
tell
room
park
just
great
good
thing
close
cheesecake
factory
stay
especially
pric
spendy
warning
stay
tell
experiance
doubletree
hotel
stayed
nights
november
arrived
virt
ually
ghost
town
lobby
wait
close
checked
young
lady
helping
line
people
bell
desk
ncierge
desk
nobody
seen
entire
check
process
mention
entire
stay
supposed
service
hotel
want
make
dinner
resv
nice
nobody
help
paid
plus
plus
parking
valet
expect
recommend
rest
area
want
hotel
understaffed
expensive
dollars
couple
eggs
place
alot
hotels
area
high
recommend
staying
fair
room
quality
unfriendly
staff
make
sure
reservation
traveling
group
team
motel
send
shut
pick
listed
double
check
room
left
items
hilton
honors
member
years
hampton
asked
guarantee
guarantee
hampton
individual
motel
decide
honor
hampton
individually
owned
complains
hilton
customer
service
pass
complaint
care
currently
reviewing
corporate
avel
policy
hotels
downgrading
hampton
resort
deleting
corporate
office
stays
dallas
dreadful
hotel
embodiment
downside
priceline
couple
weeks
prior
arrival
sent
e-mails
hotel
tempt
confirm
reservation
reponded
called
afternoon
arrival
explained
bothered
respond
e-mail
clerk
answer
asked
confirm
verbally
took
heard
shuffling
papers
background
returned
phone
uncertain
tentative
verbal
confirmation
arrived
quite
late
11:30
advised
hotel
e-mails
verbally
afternoon
case
gave
desk
clerk
advised
reservation
claimed
reservation
june
july
ridiculous
especially
handed
priceline
e-mail
confirmation
july
simply
shrugged
read
room
ground
floor
good
thing
elevators
completely
exhausted
long
train
ride
vancouver
dragged
bags
assigned
room
written
stickie
note
inserted
card
appropriate
door
open
ouple
attempts
turned
handle
enter
heard
loud
male
voice
shoot
needless
beat
hasty
retrea
desk
time
manager
desk
clerk
appeared
just
awakened
unshaven
shirt
tucked
looked
like
looked
like
told
happened
said
clerk
newly-hired
mistake
gave
card
stickie
note
room
signment
demanded
accompany
wife
said
going
shoot
going
favorite
night
manager
actually
call
awakened
apologize
hear
screaming
manager
undoubtedly
awakened
second
floor
room
eventually
occupied
truly
nasty-looking
dragging
luggage
flight
steps
pleasure
cramped
bleak
decrepit
actically
wall
paper
peeling
creaked
tiny
movement
aching
morning
awful
hotel
experiences
nter
peril
rude
desk
manager
place
ridiculous
hotel
smells
dirt
customer
service
rude
hotel
irport
reported
given
room
bedbugs
room
complained
lady
best
desk
asked
speak
management
rude
told
nothing
change
room
nice
bites
wrong
hotel
looked
room
resrvied
smeeled
vomit
lion
accross
airport
miles
north
cant
mell
nose
smoke
night
thank
time
fine
hotel
dump
just
horrible
stay
worst
maddening
waste
money
experienced
nearly
dollars
worst
hotel
experience
years
hotel
bills
hotel
thing
upscale
price
hotel
feel
like
college
dorm
freshman
dorm
clearly
run-down
hotel
seen
cosmetic
upgrades
it__Ç_é_
pretty
easy
cosmetics
hallways
dirty
poorly
room
doors
beat
feeling
secure
nervous
safety
walking
hall
room
proper
okay
bathroom
hadn__Ç_é_
enjoyed
updates
feel
like
staying
1950s
motor
yuck
hotel
walkable
dista
form
airport
took
shuttle
half
hour
pick
stood
freezing
cold
late
night
waited
waited
waited
hotel
shuttles
came
went
time
shuttle
took
ridiculously
long
time
arrive
called
twice
holiday
double
tree
just
close
looked
just
fine
check
don__Ç_é_
waste
money
dump
hotel
walkable
distanc
form
airport
took
shuttle
half
hour
pick
stood
freezing
cold
late
night
waited
waited
waited
shuttles
came
went
time
shuttle
took
ridiculously
long
time
arrive
called
twice
holiday
uble
tree
just
close
looked
just
fine
check
don__Ç_é_
waste
money
dump
avoid
costs
book
hotel
smit
nights
early
june
2007
lasted
night
hotel
quite
literally
buildin
site
radiators
double
glazing
panels
left
lying
workmens
equipment
floors
lift
operation
stairs
quite
frankly
dangerous
room
clean
wallpaper
hanging
walls
carpet
disgusting
stunk
stale
ciga
rettes
holes
ceiling
date
passed
years
clearly
hear
guests
doing
door
paper
walls
bitten
infestation
night
ended
clothes
clean
hotel
needs
closed
fully
refurbished
location
totally
misrepresents
appalling
quality
disgusting
peril
waste
money
fooled
previous
reviews
hotel
smit
convenience
museum
district
barely
saving
grace
double
bedrooms
single
beds
pushed
couple-friendly
staff
unenthusiastic
ants
shee
provided
towels
guests
shower
sprays
water
bathroom
hallways
cold
street
noise
disruptive
gourmet
described
spread
lunch
meats
good
cheese
bread
hard
boiled
eggs
juice
breakfa
free
learned
experience
star
stay
europe
going
amsterdam
time
spend
extra
cash
stay
boutique
hotel
canal
jordaan
rembrandt
square
really
makes
difference
smells
like
sewer
summary
tiny
rooms
toilet/shower
unit
room
rooms
smell
like
sewer
hallways
smel
like
raid
super
noisy
floorfriendly
faces
bottles
water
welcomed
minute
trek
metro
check
relatively
quick
ladies
desk
sweet
cherry
english
better
expected
sadly
good
thing
experienc
perfect
after
checking
bags
filled
weeks
travel
flights
stairs
elevator
tiny
room
toilet/shower
room
welcomed
strong
freshener
smell
okay
started
unpack
smell
freshener
tempor
arily
masked
started
re-dominate
small
room
distinctly
unpleasant
sewage
smell
emanating
bathroom
disgusting
needless
asked
room
midnight
asked
closed
bathroom
door
said
course
said
manager
went
upstairs
said
smelled
fine
given
room
slightly
larger
price
smelled
okay
exhausted
nearl
agreed
downstairs
hesitant
larger
room
ground
floor
scared
noise
heard
tripadvisor
reviewer
eassured
noisy
wrong
exhausted
hear
hotel
staff
friends
hanging
lobby
dishes
washed
post-midn
ight
snack
woke
opened
bathroom
door
shower
ready
faces
sewer
smell
stronger
room
moved
moved
hotel
finished
writing
hotel
complete
close
really
room
fine
stuff
stopped
working
water
jacuzzi
safe
malfunctioned
light
fixture
toilet
started
leaking
water
night
exposed
electri
wires
awakened
8:30
sounds
continuing
construction
restaurants
open
ones
great
planni
stay
months
strongly
recommend
finding
that__s
trying
hours
checking
understanding
booked
hotel
inlaws
weekend
away
unfortunately
electrical
storm
sydney
inlaws
make
flights
cancelled
called
offer
voucher
time
organise
flights
told
terribly
disappoin
ting
felt
hotel
understanding
situation
hate
sterling
hotel
dallas
pictures
website
deceiving
hotel
dirty
beds
cave
middle
cater
drivers
personnel
rude
stay
hotel
cost
average
total
score
intercontinental
standards
company
large
meeting
major
client
dallas
intercontinental
nove
mber
associate
visited
hotel
weeks
earlier
ensure
needs
handled
satisfied
booked
meeting
rooms
fortunately
experience
meeting
unsatisfactory
food
mediocre
best
served
inexperienced
banquet
pers
onnel
times
ordered
basic
norms
business
meetings
refreshed
coffee
properly
days
newly
custom
company
polo
shirts
cleaning
meeting
shirts
company
lost
despite
fact
enti
managed
having
company
shirt
washed
late
night
prior
meeting
office
manager
offered
replacement
took
nearly
weeks
event
check
follow
calls
meeting
space
needs
handled
level
professionalism
care
expected
supposedly
notch
chain
intercontinental
materials
shipped
hotel
week
advance
arrival
associate
huge
stink
management
confirming
delivered
promised
boxes
arri
time
deeped
sixed
unless
screamed
access
meeting
materials
office
cared
needs
stay
spent
fairly
good
dime
days
some
rooms
renovated
great
improvement
older
rooms
insist
shortly
ting
learned
director
sales
quit
supposedly
hotel
standards
beneath
european
hotel
fairnes
think
reason
meeting
planning
disaster
this
director
sales
offered
priority
club
poor
experience
months
later
points
credited
account
hotel
substantiate
offer
thought
onsider
lobby
area
permits
smoking
place
attract
lots
smokers
point
lobby
nearly
time
make
smoker
like
instantly
sick
finding
clothing
stinking
smoke
minutes
wait
downstairs
wait
outsi
possible
lobby
considering
hotel
meeting
north
dallas
area
suggest
avoid
hotel
purpose
does
deserve
affiliation
intercontinental
chain
generally
experience
runs
maintains
flight
propertie
consider
marriott
quorum
just
block
instead
follow
meeting
good
experience
mediocre
best
intercontinental
material
dissapointment
usually
rest
assured
intercontinen
locations
highest
order
case
intercontinental
dallas
positives
entrance
impressive
locatio
close
galleria
numerous
places
shop
recommend
hotel
intercontinental
ashamed
location
mbrella
firstly
elevators
older
stale
cigarette
smoke
odor
quite
noticeable
hallways
clean
appeare
looked
renovated
little
attention
crown
molding
doors
looked
cheap
walls
paper-thin
entering
room
hear
peron
room
door
urinating
right
urinating
extremely
loud
hallway
felt
like
person
rest
room
rooms
mediocre
best
bedding
horrible
usually
intercontinentals
superb
bedding
featherbeds
mforters
location
just
run-of-the
hotel
bedding
cheap
mattress
cheaper
bedding
stayed
holida
expresses
owned
intercontinental
hotels
nicer
sumptuous
rooms
bedding
bathrooms
lackluster
older
fixtures
outdated
shower
really
disappointing
towels
horrific
towels
holiday
presses
nicer
location
cheap
order
intercontinental
towels
extremely
disappointed
location
stay
sound
like
nitpicking
complainer
price
chump
booked
room
straight
intercontinental
plus
better
express
hampton
location
cheaper
having
stayed
intercontinental
lanta
times
spoiled
amenities
intercontinental
dallas
intercontinental
hotels
ashamed
location
bear
usually
superior
shame
intercontinental
better
confirmed
reservation
honoured
ruined
2008
hotel
booked
night
2008
night
boston
prior
eturn
presenting
confirmed
reservation
voucher
provided
travel
agents
advised
booking
record
booking
previous
rooms
available
convention
boston
evening
deliberation
accommodation
otel
miles
outside
city
inaccuracies
told
alledged
earlier
reservation
subsequently
learned
obably
presume
room
higher
rate
view
great
demand
evening
experience
ruined
hours
boston
boston
park
plaza
avoid
costs
terrible
experience
booked
priceline
great
rate
hotel
placed
college
model
convention
hotel
long
hallways
high
ceilings
noise
generated
model
un-ers
drifte
right
room
midnight
needless
sleep
night
calls
hotel
security
trying
kids
quiet
failed
solve
problem
after
sleepless
night
deliver
seminar
group
hotel
conference
center
conference
articipant
kept
awake
night
college
kids
hotel
conference
small
poorly
configured
room
worse
heat
ing/cooling
work
properly
temperature
room
degrees
started
seminar
hotel
staff
failed
orrect
problem
making
resort
opening
windows
allowing
street
noise
strong
winds
interrupt
seminar
things
worse
hotel
informed
conducting
drill
morning
meaning
alarms
interrupted
seminar
staff
response
hallway
noise
staff
failure
rectify
heating
problem
conference
room
miserable
exper
ience
hotel
clearly
grand
hotels
time
passed
better
hotel
options
boston
travelers
advised
boston
park
plaza
costs
return
park
plaza
extremely
unhappy
stay
park
plaza
level
service
embarassing
waited
minut
hold
concierge
twice
one-night
stay
evening
morning
took
minutes
check
hotel
staff
disgru
ntled
accomodating
return
park
plaza
encourage
explore
hotels
boston
exceed
park
plaza
lity
level
service
pass
executive
suite
worth
money
having
planned
seeing
boston
50th
birthday
chose
park
plaza
taying
towers
section
extra
service
extra
service
daily
breakfast
food
arrival
concierge
cleaning
early
stating
time
breakfast
week
ended
earlier
weekend
literature
booking
time
fference
meant
early
having
paid
extra
pampered
definitely
hotel
stay
pampering
conci
erge
itinerary
heard
needless
concierge
typically
present
desk
ignored
unless
engaged
conv
ersation
previous
sentence
regarding
result
request
pictures
rooms
online
rooms
small
queen
size
desk
dresser
took
room
just
small
walk-way
hotel
convenient
park
hotels
conve
nient
activities
boston
probably
prone
customer
satisfaction
dissatisfied
defninitely
recommend
addition
brother-in-law
died
requested
leave
early
hotel
told
park
plaza
allow
refund
early
departure
mind
hotel
advertises
changes
accomodated
misleading
concerened
noisy
uncomfortable
horrible
service
staff
gave
